Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
/******************************************************************************
 Software License Agreement:

 The software supplied herewith by Microchip Technology Incorporated
 (the "Company") for its PICmicro(r) Microcontroller is intended and
 supplied to you, the Company's customer, for use solely and
 exclusively on Microchip PICmicro Microcontroller products. The
 software is owned by the Company and/or its supplier, and is
 protected under applicable copyright laws. All rights are reserved.
 Any use in violation of the foregoing restrictions may subject the
 user to criminal sanctions under applicable laws, as well as to
 civil liability for the breach of the terms and conditions of this
 license.

 THIS SOFTWARE IS PROVIDED IN AN "AS IS" CONDITION. NO WARRANTIES,
 WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
********************************************************************/
#include <xc.h>
#include "bt_hardware_profile.h"
#include "bt_app.h"
#include "bt_data.h"
#include "bt_command_send.h"
#include "bt_command_decode.h"
#include "bt_volume.h"
#include "bt_multi_spk.h"
#include "bt_line_in.h"
#include "bt_a2dp.h"
#include "bt_hfp.h"
#include "timer.h"
#include "sta369bwdsp_handler.h"
#include "led.h"
#include "key.h"

//===============================================
//  VARIABLES CLAIM
//===============================================
BTAPP_TASK_STATE BTAPP_TaskState;
BTAPPRUNNING_TASK_STATE BTAppRunning_TaskState;
uint8_t BTAPP_TaskRequest;
BTAPP_STATUS BTAPP_Status;        //BTM system status
BT_PORTS BTAPP_Ports;
uint16_t BTAPP_timer1ms;
uint8_t timeout_flag = 0;
//uint16_t DSP_UnmuteTimer1ms; 

#ifdef _BLE_ADV_CTRL_BY_MCU
#define BLE_DEVNAME_MAX_LEN    29
BLE_ADV_TYPE BLE_advType;
uint8_t BT_deviceName[BLE_DEVNAME_MAX_LEN + 1];
uint8_t BT_MasterAddr[6];
uint8_t BT_groupstatus;
uint8_t BT_groupLinkEvent;
uint8_t BT_btmState, BT_btmStateTemp;
uint8_t BT_bleAdvFeature = 1;

#endif
BT_AT_MODE BTAPP_AT_Mode = AT_TX;
AT_SOURCE_INPUT BTAPP_AT_Source = TX_SOURCE_AUX;
AT_SAMPLING_RATE BTAPP_AT_SamplingRate = TX_SAMPLING_RATE_48KHZ;

uint8_t BT_pwrOnInquiry;
uint8_t BT_TxConnectedDevices;
Searched_Result found_dev;

#define AT_SINKS 2

#ifdef _CODE_FOR_APP
#define DSP_EQ_SIZE    84
#define DSP_EQ_SEND_INTERVAL   100		   //  100ms
#define BTEQ_MAX_INDEX		   11		   // 84bytes + 1-seq each packet ==> 84/8 = 11 packets
uint16_t BTEQ_timer1ms;
 enum {
	 MULTI_SPK_EQ_ALL = 0,
	 MULTI_SPK_EQ_MASTER,
	 MULTI_SPK_EQ_SLAVE,
 } multiSpk_eq_route;
uint8_t BTEQ_SendIndex;
uint8_t BTEQ_RecIndex;
uint8_t dspEQ[DSP_EQ_SIZE+6];
#endif

 /*-----------------------------------------------------------------------------*/
/**/
/*-----------------------------------------------------------------------------*/
///////////////////////////////////////////////////////////////////////////////
 //=======================================================================
//  FUNCTION IMPLEMENTION
//========================================================================

//================================================
// Init
//================================================
void BTAPP_Init( void )
{
    Set_LED_Style(LED_2, LED_OFF, 500, 500);
    Set_LED_Style(LED_3, LED_OFF, 500, 500);
    
    BTAPP_TaskState = BT_STATE_INITIALIZE_START;
    
    BTAPP_Status.status = BT_SYSTEM_POWER_OFF;
    BTMSPK_Init();
    BTMA2DP_Init();
    BTMHFP_Init();
    BTM_LINE_IN_Init();
    
    BT_CommandDecodeInit();
    BT_CommandSendInit();
    BTVOL_Init();
    BTMDATA_Init();
    
    BTAPP_Ports.PORT_1.value = 0;
    BTAPP_Ports.PORT_2.value = 0;
    BTAPP_Ports.PORT_3.value = 0;
    BTAPP_Ports.PORT_4.value = 0;
#ifdef _CODE_FOR_APP    
	BTEQ_timer1ms = 0;
	BTEQ_SendIndex = BTEQ_MAX_INDEX+1;	// assum it finish the packet sending
	BTEQ_RecIndex = 0;		// expect to see first packet
#endif

	BT_pwrOnInquiry = 0;
	BT_TxConnectedDevices = 0;

}

//================================================
// Task
//================================================
void BTAPP_Task(void) {
    switch (BTAPP_TaskState) {
        case BT_STATE_INITIALIZE_START:
            BTAPP_timer1ms = 500;           //wait external circuit to get stable power
            BTAPP_TaskState = BT_STATE_INIT_MFB_HIGH;
            break;

        case BT_STATE_INIT_MFB_HIGH:
            if (!BTAPP_timer1ms) {
                BTAPP_timer1ms = 20;
                BM6X_MFB_SetHigh();
                BTAPP_TaskState = BT_STATE_INIT_RESET_HIGH;
            }
            break;

        case BT_STATE_INIT_RESET_HIGH:
            if (!BTAPP_timer1ms) {
                BM6X_RESET_SetHigh();
                BT_CommandDecodeInit();
                BTAPP_timer1ms = 500; //wait 500ms
                BTAPP_TaskState = BT_STATE_INIT_RESET_HIGH_WAIT;
            }
            break;

        case BT_STATE_INIT_RESET_HIGH_WAIT:
            if (!BTAPP_timer1ms) //check 500ms times up
            {
                BTAPP_TaskState = BT_STATE_INIT_COMMAND_START;
            }
            break;

        case BT_STATE_INIT_COMMAND_START:
            if(BTAPP_Status.status == BT_SYSTEM_POWER_OFF){
                if(BT_IsCommandSendTaskIdle()){
                    BT_SetRXBufferSize();
                    BT_ReadFWVersion();
                    BT_ReadUARTVersion();
					BT_ReadATMode();
					BT_ReadTxSource();
					BT_ReadTxSamplingRate();
                    BT_ReadDeviceAddressCommand();
                    BT_ReadFeatureListCommand();    //new added for MBA
                    BT_ReadDeviceNameCommand();
                    BTAPP_TaskState = BT_STATE_INIT_READ_DEVICE_NAME_WAIT;
                    BTAPP_timer1ms = 2000;      //set 2000ms time out
                }
            }
            break;

        case BT_STATE_INIT_READ_DEVICE_NAME_WAIT:
            if(!BTAPP_timer1ms)
            {
                BTAPP_timer1ms = 1000;
                BT_ReadDeviceNameCommand();        //retry
            }
            break;

        case BT_STATE_INIT_BLE_ADV_START:
#ifdef _BLE_ADV_CTRL_BY_MCU            
            BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BLE_forceUpdate();
#endif           
            BTAPP_TaskState = BT_STATE_INIT_BLE_ADV_WAIT;
		 	BTAPP_timer1ms = 1000;
         break;
         
		case BT_STATE_INIT_BLE_ADV_WAIT:
			if( !BTAPP_timer1ms )
			{			
				BTAPP_TaskState = BT_STATE_POWER_OFF;
			}
		break;
        
        case BT_STATE_POWER_ON_START:
            if(is_sta369bwdsp_idle())
            {
                sta369bwdsp_start();
            }
            BTAPP_TaskState = BT_STATE_POWER_DSP_WAIT;
            break;
            
        case BT_STATE_POWER_DSP_WAIT:    
            if(!is_sta369bwdsp_ready())
                return;
            if ( BT_IsCommandSendTaskIdle() )
            {
                BT_MMI_ActionCommand(POWERON_BUTTON_PRESS, 0); //POWER ON button pressed command
                BT_MMI_ActionCommand(POWERON_BUTTON_RELEASE, 0); //POWER ON button released command
                BTAPP_TaskState = BT_STATE_POWER_ON;//BT_STATE_POWER_ON_BUTTON_PRESSED;
                break;
            }
            if (BTAPP_TaskRequest == BT_REQ_SYSTEM_OFF)
            {
                BTAPP_TaskState = BT_STATE_POWER_OFF;
                BTAPP_TaskRequest = BT_REQ_NONE; //clear request
            }
            break;

