Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
        case BT_STATE_POWER_ON:
#ifdef _BLE_ADV_CTRL_BY_MCU             
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
        	//BLE_forceUpdate();
            BTVOL_InitVolMode();
            BT_ReadNSpkStatus();        //this command issues 0x33 event, and 0x33 event will issue BLE_forceUpdate()
#else
            BTVOL_InitVolMode();
#endif            
			BTAPP_TaskState = BT_STATE_READ_PAIR_RECORD;
            break;

        case BT_STATE_READ_PAIR_RECORD:
            if(BT_IsCommandSendTaskIdle()){
                BT_GetPairRecordCommand();
                BTAPP_TaskState = BT_STATE_READ_PAIR_RECORD_WAIT;
                BTAPP_timer1ms = 1000; //set 1000 time out
            }
            break;

        case BT_STATE_READ_PAIR_RECORD_WAIT:
            if (!BTAPP_timer1ms) {              //time out
                BTAPP_Status.pairedRecordNumber = 0;
                BT_GetPairRecordCommand();
                BTAPP_timer1ms = 1000; //set time out
            }
            break;
		case BT_STATE_TX_PAIRING_KEY_WAIT:
            if (!BTAPP_timer1ms) {              //time out
				BTAPP_TaskState = BT_STATE_LINKBACK_START;
            }
		break;
        case BT_STATE_LINKBACK_START:
			// Power on link back only happen on AT RX
			// Require to press pairing button to link back on AT TX
            if((BT_IsCommandSendTaskIdle()))
            {
            	if(BTAPP_AT_Mode == AT_RX)
            	{
	                if(BTAPP_Status.pairedRecordNumber != 0)	                
		                BT_LinkBackToLastDevice();
	                else
	                   	BT_MMI_ActionCommand(ANY_MODE_ENTERING_PAIRING, 0);
            	}
				if(BTAPP_AT_Mode == AT_TX)
				{
					// Inquiry mode
					if(BT_pwrOnInquiry)
					{
						BT_pwrOnInquiry = 0;
						if(BTAPP_Status.status == BT_SYSTEM_STANDBY)
						{
							BTAPP_EnterInquiryMode();
						}
					}
					// Link back
					else if(BTAPP_Status.pairedRecordNumber != 0)
					{
						BTAPP_Status.status = BT_SYSTEM_LINK_BACK;
						BT_LinkBackToLastDevice();					
					}
					else
					{
						// Nothing to do
						// Just go to BT_STATE_BT_RUNNING 
					}
				}
				BTAPP_TaskState = BT_STATE_BT_RUNNING;
            }
            break;

        case BT_STATE_BT_RUNNING:
            if(BTAPP_TaskRequest == BT_REQ_SYSTEM_OFF)
                BTAPP_TaskState =  BT_STATE_POWER_OFF_START;
            BTAPP_TaskRequest = BT_REQ_NONE;

            if (BTAPP_TaskState == BT_STATE_BT_RUNNING)
            {
                if (BTAppRunning_TaskState == BT_RUNNING_STATE_IDLE)
                {
                }
                else if (BTAppRunning_TaskState == BT_RUNNING_STATE_MUTE)
                {
                    if (!BTAPP_timer1ms)
                    {
                        BTVOL_ChangeVolMode(BTVOL_GetVolMode(), false);
                        BTAppRunning_TaskState = BT_RUNNING_STATE_IDLE;
                    }
                }
                
            }
            break;
		case BT_STATE_BT_AT_CONNECT:
            if(BTAPP_TaskRequest == BT_REQ_SYSTEM_OFF)
                BTAPP_TaskState =  BT_STATE_POWER_OFF_START;
            BTAPP_TaskRequest = BT_REQ_NONE;

		break;
        case BT_STATE_POWER_OFF_START:
            BTAPP_TaskRequest = BT_REQ_NONE; //clear request
            if(BT_IsCommandSendTaskIdle()){
                if( (BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_NSPK_MASTER)              //NSPK master
                        || (BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_NSPK_SLAVE)        //NSPK slave
                        || (BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_BROADCAST_MASTER)  //Broadcast master
                        || (BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_BROADCAST_MASTER_CONNECTING )   //Broadcast master
                        || (BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_BROADCAST_SLAVE) )    
                {
                    BT_MMI_ActionCommand(POWER_OFF_ALL_SPK, 0 );
                    BTAPP_TaskState = BT_STATE_POWER_OFF_WAIT_NSPK_EVENT;
                    BTAPP_timer1ms = 500;
                    timeout_flag = 0; //Clear Timeout flag
                }
                else
                {
                    BT_MMI_ActionCommand(POWEROFF_BUTTON_PRESS, 0 );
                    BT_MMI_ActionCommand(POWEROFF_BUTTON_RELEASE, 0 );
                    BTAPP_TaskState = BT_STATE_POWER_OFF_WAIT;
                }
            }
            break;
        
        case BT_STATE_POWER_OFF_WAIT_NSPK_EVENT:
            if (!BTAPP_timer1ms) {
                BT_MMI_ActionCommand(POWER_OFF_ALL_SPK, 0 );
                BTAPP_timer1ms = 500;
                if(timeout_flag++ >= 60)
                { 
                    BTAPP_TaskState = BT_STATE_POWER_OFF_START_NSPK;  //Concert/Stereo master failed to respond; go for power off
                }
            }
            break;
            
        case BT_STATE_POWER_OFF_START_NSPK:
            if(BT_IsCommandSendTaskIdle()){
                BT_MMI_ActionCommand(POWEROFF_BUTTON_PRESS, 0 );
                BT_MMI_ActionCommand(POWEROFF_BUTTON_RELEASE, 0 );
                BTAPP_TaskState = BT_STATE_POWER_OFF_WAIT;
            }
            break;

        case BT_STATE_POWER_OFF_WAIT:
            if( BTAPP_Status.status == BT_SYSTEM_POWER_OFF )
            {
                BTM_LINE_IN_Init();
                BTVOL_Init();
                BTAPP_TaskState = BT_STATE_POWER_OFF;
            }
            break;

        case BT_STATE_POWER_OFF:
            if (BTAPP_TaskRequest != BT_REQ_NONE) {
                if (BTAPP_TaskRequest == BT_REQ_SYSTEM_ON) {
                    BTAPP_TaskState = BT_STATE_POWER_ON_START;
                    BTAPP_TaskRequest = BT_REQ_NONE; //clear request
                }
            }
            break;

        default:
            break;

