Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
    }

    if (BTAPP_TaskState >= BT_STATE_INIT_COMMAND_START) {
        BT_CommandDecodeMain();
        BT_CommandSendTask();
#ifdef _CODE_FOR_APP        
		BT_SendEQBytes();       //sequencialy send EQ bytes received from APP to slave
#endif
    }
}

//================================================
//BT status checking
//================================================
uint8_t BTAPP_GetStatus(void)
{
	
	if(BTAPP_TaskState == BT_STATE_POWER_OFF)
        return BT_STATUS_OFF;
    else if(BTAPP_TaskState >= BT_STATE_POWER_ON && BTAPP_TaskState < BT_STATE_BT_RUNNING)
        return BT_STATUS_ON;
    else if(BTAPP_TaskState == BT_STATE_BT_RUNNING || 
			BTAPP_TaskState == BT_STATE_BT_AT_CONNECT
		    )
        return BT_STATUS_READY;
    else
        return BT_STATUS_NONE;
}

//================================================
// BT Event Handler
//================================================
void BTAPP_EventHandler(BT_APP_EVENTS event, uint8_t* paras, uint16_t size )
{
	uint8_t i=0;
    uint8_t nspk_link_status, nspk_link_event;
#ifdef _SUPPORT_SIMPLE_33_EVENT
    uint8_t send_master_address[7];
#endif    
    switch(event)
    {
        case BT_EVENT_CMD_SENT_ACK_OK:
            break;
            
        case BT_EVENT_CMD_SENT_ACK_ERROR:
            BT_GiveUpThisCommand();
			if(paras[0] == PROFILE_LINK_BACK)
			{
				if(BTAPP_Status.status == BT_SYSTEM_LINK_BACK)
					BTAPP_Status.status = BT_SYSTEM_STANDBY;
			}
            break;
            
        case BT_EVENT_CMD_SENT_NO_ACK:
            if(*paras == 0x04 || *paras == 0x02)        //MMI_ACTION or MUSIC_CTRL
                BT_GiveUpThisCommand();
            break;
            
        case BT_EVENT_NSPK_VENDOR_CMD:
#ifdef _CODE_FOR_APP    
		if( (paras[0x03] & 0xf0) == 0x80 )      //Vendor EQ handle
		{
			// Vendor EQ commands
			paras[0x03] -= 0x80;
			if(paras[0x03] == 0x00)
			{
				for(i=0; i<DSP_EQ_SIZE; i++)
					dspEQ[i] = 0;
	
				dspEQ[0] = 0xAA;	 //header byte 0
				dspEQ[1] = 0x00;	 //header byte 1
				dspEQ[2] = 84+2;	 //length
				dspEQ[3] = 0x30;		//command ID
				dspEQ[4] = 0x13;	   //link_index, set to 0
	
				BTEQ_RecIndex = 0;
			}
			else if(paras[0x03] >= BTEQ_MAX_INDEX)
			{
				// Seq out range, do nothing.
				//break;
			}
			
			if(paras[0x03] == BTEQ_RecIndex)
			{
				if(paras[2] == 9)
				{
					for(i=0; i<8;i++)
						dspEQ[5 + (BTEQ_RecIndex * (VENDOR_CMD_SIZE-1)) + i] = paras[4 +i]; 
				}
				else 
				{
					for(i=0; i<4;i++)
						dspEQ[5 + (BTEQ_RecIndex * (VENDOR_CMD_SIZE-1)) + i] = paras[4 +i]; 
				}	
				BTEQ_RecIndex++;
				if(BTEQ_RecIndex == BTEQ_MAX_INDEX)
				{
					BTEQ_RecIndex = 0;
					// the EQ data completed
					BT_SendBytesAsEQCommandWithRedoChecksum(dspEQ, 90);				
				}			
			}
			else
			{
				// Get the wrong seq-packet.
				// Ignore all the packet until see the first packet.
				
			}
			return;
		}
		else        //other Vendor events handle
		{
            switch( paras[0x03] )
            {
                //case 1:
                case 0xFE:      //vol sync to slave
                    //BTVOL_EventHandler(BT_EVENT_AVRCP_ABS_VOLUME_CHANGED, &paras[3], 2 );
                    BTVOL_GotSyncVolFromMasterByVendorCmd(paras[4], paras[5]);
                    break;
                case 0xFD:
#ifdef _SUPPORT_SIMPLE_33_EVENT
    #ifdef _BLE_ADV_CTRL_BY_MCU                            
			BLE_SaveMasterAddr( &paras[4] );
            BLE_advUpdateGroupStatus(SPEAKER_nSPK_SLAVE);
            BLE_UpdateAdvType(SCANNABLE_UNDIRECT_ADV); //non-connectable
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
    #endif 
#endif
                    break;
                case 0xFC:
                    if( BTAPP_Status.BDAddr[0] == paras[4] 
                            && BTAPP_Status.BDAddr[1] == paras[5]
                            && BTAPP_Status.BDAddr[2] == paras[6]
                            && BTAPP_Status.BDAddr[3] == paras[7] )
                    {
                        BT_MMI_ActionCommand(paras[10], 0);
                    }
                    break;
                default:
                    break;
            }
		} 
#endif            
            break;
            
        case BT_EVENT_MSPK_STANDBY:
            Set_LED_Style(LED_2, LED_OFF, 500, 500);
            Set_LED_Style(LED_3, LED_OFF, 500, 500);
            //if( BTAPP_Status.status == BT_SYSTEM_STANDBY && BTAPP_Status.groupLinkingBack == true)
            //{
            //    BTAPP_Status.groupLinkingBack = false;
            //    BT_LinkBackToLastDevice();
            //}
#ifdef _BLE_ADV_CTRL_BY_MCU                    
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
			BLE_advUpdateGroupStatus(SPEAKER_SINGLE);	
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif              
            break;
        case BT_EVENT_MSPK_CONNECTING:
            Set_LED_Style(LED_2, LED_BLINK, 500, 500);
            Set_LED_Style(LED_3, LED_BLINK, 500, 500);
#ifdef _UNSUPPORT_3A_EVENT   
            if( BTAPP_TaskState == BT_STATE_READ_LINKED_MODE )
            {
                BTAPP_TaskState = BT_STATE_BT_RUNNING;
            }
#endif
#ifdef _BLE_ADV_CTRL_BY_MCU
			//BLE_advUpdateGroupStatus(SPEAKER_CONNECTING);       //EA app
            BLE_advUpdateGroupStatus(SPEAKER_SINGLE);               //v1.16 app
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_MSPK_CONNECTED_AS_NSPK_MASTER:
            //Set_LED_Style(LED_2, LED_ON, 500, 500);   //BT_EVENT_MSPK_SYNC_AUDIO_CHANNEL will set LED2&3 in NSPK mode
            //Set_LED_Style(LED_3, LED_ON, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU
            BLE_advUpdateGroupStatus(SPEAKER_nSPK_MASTER);
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif
#ifdef _SUPPORT_SIMPLE_33_EVENT
            //send master address to slave, only for stereo mode, not needed for concert mode
            send_master_address[0] = 0xFD;
            send_master_address[1] = BTAPP_Status.BDAddr[0];
            send_master_address[2] = BTAPP_Status.BDAddr[1];
            send_master_address[3] = BTAPP_Status.BDAddr[2];
            send_master_address[4] = BTAPP_Status.BDAddr[3];
            send_master_address[5] = BTAPP_Status.BDAddr[4];
            send_master_address[6] = BTAPP_Status.BDAddr[5];
            BT_Vendor_SendCommand(send_master_address, 7);
#endif
            break;
        case BT_EVENT_MSPK_CONNECTED_AS_NSPK_SLAVE:
            //Set_LED_Style(LED_2, LED_ON, 500, 500);   //BT_EVENT_MSPK_SYNC_AUDIO_CHANNEL will set LED2&3 in NSPK mode
            //Set_LED_Style(LED_3, LED_ON, 500, 500);
            Set_LED_Style(LED_1, LED_OFF, 500, 500);            //turn off BT LED when slave role is confirmed
#ifndef _SUPPORT_SIMPLE_33_EVENT        //undefine this macro for MSPK, define it for 104 ROM
#ifdef _BLE_ADV_CTRL_BY_MCU                            
			BLE_SaveMasterAddr( BTMSPK_GetMasterBDAddress() );
            BLE_advUpdateGroupStatus(SPEAKER_nSPK_SLAVE);
            BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV); //connectable
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif
#endif
            break;
        case BT_EVENT_MSPK_CONNECTED_AS_BROADCAST_MASTER:
            Set_LED_Style(LED_2, LED_ON, 500, 500);
            Set_LED_Style(LED_3, LED_ON, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU
            BLE_advUpdateGroupStatus(SPEAKER_BROADCAST_MASTER_ADDING);
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_MSPK_CONNECTED_AS_BROADCAST_SLAVE:
            Set_LED_Style(LED_2, LED_ON, 500, 500);
            Set_LED_Style(LED_3, LED_ON, 500, 500);
            Set_LED_Style(LED_1, LED_OFF, 500, 500);            //turn off BT LED when slave role is confirmed
#ifdef _BLE_ADV_CTRL_BY_MCU
			BLE_SaveMasterAddr( BTMSPK_GetMasterBDAddress() );
            BLE_advUpdateGroupStatus(SPEAKER_BROADCAST_SLAVE);
            BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV); //connectable
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif              
            break;
        case BT_EVENT_MSPK_BROADCAST_MASTER_CONNECTING_MORE:
            Set_LED_Style(LED_3, LED_BLINK, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app
            BLE_advUpdateGroupStatus(SPEAKER_BROADCAST_MASTER_ADDING);
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif             
            break;
        case BT_EVENT_MSPK_BROADCAST_MASTER_CONNECTING_END:
            Set_LED_Style(LED_2, LED_ON, 500, 500);
            Set_LED_Style(LED_3, LED_ON, 500, 500);
            //if( BTAPP_Status.status == BT_SYSTEM_STANDBY && BTAPP_Status.groupLinkingBack == true)
            //{
            //    BTAPP_Status.groupLinkingBack = false;
            //    BT_LinkBackToLastDevice();
            //}
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app
            BLE_advUpdateGroupStatus(SPEAKER_BROADCAST_MASTER_ADDING);
			BLE_UpdateAdvType(CONNECTABLE_UNDIRECT_ADV);
            BTMSPK_GetNSPKLinksStatusAndEvent( &nspk_link_status, &nspk_link_event );
            BLE_advUpdateLinkStatus(nspk_link_event);
            BLE_forceUpdate();
#endif             
            break;
        case BT_EVENT_MSPK_BROADCAST_SLAVE_POWER_OFF:
            BTAPP_TaskState =  BT_STATE_POWER_OFF_START;
            break;
        case BT_EVENT_MSPK_SYNC_AUDIO_CHANNEL:
            if(*paras == 0x01)      //L+L
            {
                Set_LED_Style(LED_2, LED_ON, 500, 500);
                Set_LED_Style(LED_3, LED_OFF, 500, 500);
            }
            else if(*paras == 0x02)     //R+R
            {
                Set_LED_Style(LED_2, LED_OFF, 500, 500);
                Set_LED_Style(LED_3, LED_ON, 500, 500);
            }
            else
            {
                Set_LED_Style(LED_2, LED_ON, 500, 500);
                Set_LED_Style(LED_3, LED_ON, 500, 500);
            }
            break;

        case BT_EVENT_HFP_LINK_CONNECTED:
            BTAPP_Status.status = BT_SYSTEM_CONNECTED;
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_HF,true))
                BLE_forceUpdate();
#endif
            break;
        case BT_EVENT_HFP_LINK_DISCONNECTED:
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_HF,false))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_SPP_LINK_CONNECTED:
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_SPP_IAP,true))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_IAP_LINK_CONNETED:
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_SPP_IAP,true))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_SPP_IAP_LINK_DISCONNECTED:
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_SPP_IAP,false))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_A2DP_LINK_CONNECTED:
        case BT_EVENT_A2DP_LINK_CHANGED:
			if(BTAPP_TaskState == BT_STATE_BT_AT_CONNECT)
			{
				BTAPP_ConnectNextSink();
			}
            BTAPP_Status.status = BT_SYSTEM_CONNECTED;
            Set_LED_Style(LED_1, LED_ON, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_A2DP,true))
                BLE_forceUpdate();
#endif             
            break;
        case BT_EVENT_A2DP_LINK_DISCONNECTED:
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_CONN_A2DP,false))
                BLE_forceUpdate();
#endif            
            break;
            
        case BT_EVENT_SYS_POWER_ON:
            BTAPP_Status.status = BT_SYSTEM_POWER_ON;
            Set_LED_Style(LED_0, LED_ON, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_STBY,true))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_SYS_POWER_OFF:
            BTAPP_Status.status = BT_SYSTEM_POWER_OFF;
            Set_LED_Style(LED_1, LED_OFF, 500, 500);
            Set_LED_Style(LED_0, LED_OFF, 500, 500);
            Set_LED_Style(LED_2, LED_OFF, 500, 500);    //MSPK link lost indicator
            Set_LED_Style(LED_3, LED_OFF, 500, 500);    //MSPK link lost indicator
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_OFF,true))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_SYS_STANDBY:
            BTAPP_Status.status = BT_SYSTEM_STANDBY;
            Set_LED_Style(LED_1, LED_OFF, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_STBY,true))
                BLE_forceUpdate();
#endif            
            break;

        case BT_EVENT_SYS_PAIRING_START:
            BTAPP_Status.status = BT_SYSTEM_PAIRING;
            Set_LED_Style(LED_1, LED_BLINK, 100, 100);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_PAIR,true))
                BLE_forceUpdate();
#endif            
            break;
        case BT_EVENT_SYS_PAIRING_OK:
            break;
        case BT_EVENT_SYS_PAIRING_FAILED:
            Set_LED_Style(LED_1, LED_OFF, 500, 500);
#ifdef _BLE_ADV_CTRL_BY_MCU         //v1.16 app            
            if(BLE_advUpdateBTMState(BLE_BTM_STBY,true))
                BLE_forceUpdate();
#endif             
            break;

        case BT_EVENT_LINKBACK_SUCCESS:
			if(BTAPP_AT_Mode == AT_TX)
			{

