Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
			}
            break;

        case BT_EVENT_LINKBACK_FAILED:
            Set_LED_Style(LED_1, LED_OFF, 500, 500);
			if(BTAPP_AT_Mode == AT_TX)
			{
				if(BTAPP_TaskState == BT_STATE_BT_AT_CONNECT)
				{
					BTAPP_ConnectNextSink();
				}
			}			
            break;

       case BT_EVENT_BD_ADDR_RECEIVED:
           BTAPP_Status.BDAddr[0] = *paras++;
           BTAPP_Status.BDAddr[1] = *paras++;
           BTAPP_Status.BDAddr[2] = *paras++;
           BTAPP_Status.BDAddr[3] = *paras++;
           BTAPP_Status.BDAddr[4] = *paras++;
           BTAPP_Status.BDAddr[5] = *paras;
            break; 
			
	   case BT_EVENT_NAME_RECEIVED:
#ifdef _BLE_ADV_CTRL_BY_MCU           
           BLE_SaveDeviceName(paras);
#endif           
			if(BTAPP_TaskState == BT_STATE_INIT_READ_DEVICE_NAME_WAIT)
			{
				BTAPP_timer1ms = 0;
				BTAPP_TaskState = BT_STATE_INIT_BLE_ADV_START;
			}
			break;

        case BT_EVENT_PAIR_RECORD_RECEIVED:
            BTAPP_Status.pairedRecordNumber = *paras;
            if(BTAPP_TaskState == BT_STATE_READ_PAIR_RECORD_WAIT)
            {
        		BTAPP_timer1ms = KEY_SECONDARY_HOLD_DELAY;
                BTAPP_TaskState = BT_STATE_TX_PAIRING_KEY_WAIT;
            }
            break;

        case BT_EVENT_A2DP_BREAK_IN:
            BTAPP_timer1ms = 500;
            BTAppRunning_TaskState = BT_RUNNING_STATE_MUTE;
            break;

        case BT_EVENT_MSPK__SYNC_POWER_OFF:
            BTAPP_TaskState = BT_STATE_POWER_OFF_START_NSPK;
            break;

        case BT_EVENT_PORT_INPUT_CHANGED:
            break;
            
        case BT_EVENT_BTM_VERSION:
            if(paras[0] == 0x01)        //1: FW version
            {
                BTAPP_Status.FWVer[0] = paras[1];
                BTAPP_Status.FWVer[1] = paras[2];
            }
            else                        //0: UART version
            {
                BTAPP_Status.UARTVer[0] = paras[1];
                BTAPP_Status.UARTVer[1] = paras[2];
            }
            break;
        
        case BT_EVENT_BATTERY_LEVEL:
            BTAPP_Status.batteryStatus = paras[0];      //save battery status
            BTAPP_Status.batteryLevel = paras[1];       //save battery level
            break;
        
        case BT_EVENT_FEATURE_LIST_RECEIVED:
#ifdef _BLE_ADV_CTRL_BY_MCU
            BLE_SaveFeatureList(paras[0]);
#endif
            break;
        
        case BT_EVENT_BTM_INITIALIZED:
            if(BTAPP_TaskState > BT_STATE_INIT_READ_DEVICE_NAME_WAIT)
                BTAPP_Init();
            break;
        
        case BT_EVENT_REPORT_TYPE_CODEC:
            if(paras[1] == BT_A2DP)
            {
                if(BTVOL_GetVolMode() == A2DP_VOL_MODE)
                    BTVOL_ChangeVolMode(A2DP_VOL_MODE, false);
                else
                {
                    sta369bw_SetVol(1);
                    BTVOL_SetVolMode(A2DP_VOL_MODE);
                    BTAPP_EventHandler( BT_EVENT_A2DP_BREAK_IN, 0, 0);
                }
            }
            else if(paras[1] == BT_HFP)
            {
                BTVOL_ChangeVolMode(HFP_VOL_MODE, false);
            }
            else if(paras[1] == BT_LINE_IN)
            {
                if(BTVOL_GetVolMode() == LINE_IN_VOL_MODE)
                    BTVOL_ChangeVolMode(LINE_IN_VOL_MODE, false);
                else
                {
                    sta369bw_SetVol(1);
                    BTVOL_SetVolMode(LINE_IN_VOL_MODE);
                    BTAPP_EventHandler( BT_EVENT_A2DP_BREAK_IN, 0, 0);
                }
            }
            break;
		case BT_EVENT_AT_SOURCE_CHANGE:
			BTAPP_AT_Source	= paras[1];
		break;
		case BT_EVENT_AT_MODE_CHANGE:
			BTAPP_AT_Mode = paras[1];
		break;
		case BT_EVENT_AT_SAMPLING_RATE_CHANGE:
			BTAPP_AT_SamplingRate = paras[1];
		break;
		case BT_EVENT_INQUIRY_RESPONSE:
			BTAPP_ExtractInqurySinkInfo(paras+1);
		break;			
		case BT_EVENT_INQUIRY_COMPLETE:		
			// Start to connect the inquired devices
			if(paras[1] == 0)
			{
				// Success
				BT_BlockTxA2DPStream(true);
				found_dev.tryConnectNum = found_dev.dev_num;
				BTAPP_ConnectNextSink();
			}
			else
			{
				// Failure , please refer API document for failure code
				BTAPP_TaskState = BT_STATE_BT_RUNNING;
			}
		break;
		case BT_EVENT_ACL_CONNECTED:
			if(BTAPP_AT_Mode == AT_TX)
			{
				++BT_TxConnectedDevices;
				if(BTAPP_Status.pairedRecordNumber==0)
					BTAPP_Status.pairedRecordNumber = BT_TxConnectedDevices;
			}
		break;
		case BT_EVENT_ACL_DISCONNECTED:
			if(BTAPP_AT_Mode == AT_TX)
				BT_TxConnectedDevices--;
		break;
		case BT_EVENT_INQUIRY_STARTED:
				BTAPP_Status.status = BT_SYSTEM_INQUIRY;
        default:
            break;
    }
}

//================================================
// BT Task Request
//================================================
void BTAPP_TaskReq(uint8_t request)
{
    BTAPP_TaskRequest = request;
}

//================================================
//1ms Timer
//================================================
void BTAPP_Timer1MS_event( void )
{
    if(BTAPP_timer1ms)
        --BTAPP_timer1ms;
	//if(DSP_UnmuteTimer1ms)
    //{
    //    --DSP_UnmuteTimer1ms;
    //    if(!DSP_UnmuteTimer1ms)
    //    {
    //        DSP_MUTE_SetHigh(); 
    //    }
    //}
#ifdef _CODE_FOR_APP    
    if(BTEQ_timer1ms)
		--BTEQ_timer1ms;
#endif    
}

/*-----------------------------------------------------------------------------*/
//EXTERNAL API interface(for UI)
/*-----------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------*/
void BTAPP_ResetSinksInfo()
{
    memset(&found_dev,0, sizeof(found_dev));
}

void BTAPP_ExtractInqurySinkInfo(uint8_t* rcvd_buf)
{
    int i=0, index=0;
	
    if(found_dev.dev_num >= INQUIRY_DEVICES_NUM)
		return;
    index = found_dev.dev_num;
    for(i=0;i<6;i++)
    {
        found_dev.dev_id[index].bt_address[i] = *rcvd_buf++;
    }
    found_dev.dev_id[index].class_of_dev[0] = *rcvd_buf++;
    found_dev.dev_id[index].class_of_dev[1] = *rcvd_buf++;
    found_dev.dev_id[index].class_of_dev[2] = *rcvd_buf++;
	found_dev.dev_id[index].rssi_val = *rcvd_buf++;
	// Dont handle Extended inquiry response here
    found_dev.dev_num++;
    found_dev.dev_id[index].toConnect = false;

