Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
}
// Find a best RSSI sink device to connect
bool BTAPP_ConnectNextSink(void)
{
    uint8_t i=0, bestRssi = 0, bestRssiDevId=TX_MAX_SINK_DEVICES_NUM;
	// Check if there are already two devices connected 
	// Check if it already tried all devices
	if( (BT_TxConnectedDevices >= TX_MAX_SINK_DEVICES_NUM) ||
		(found_dev.tryConnectNum == 0))
    {
    	// Start music playback when there is at least one connected device
    	if(BT_TxConnectedDevices > 0)
			BT_BlockTxA2DPStream(false);
   		BTAPP_TaskState = BT_STATE_BT_RUNNING;
		return false;
    }
	// Search in the table to find a best RSSI
	// If "toConnect" is true, the devices have been tried to connect
	// Only look at the devices have not been tried

    for(i=0;i<found_dev.dev_num;i++)
    {
        if(found_dev.dev_id[i].toConnect==false)
        {
	        if(found_dev.dev_id[i].rssi_val >= bestRssi)
	        {
				bestRssi = found_dev.dev_id[i].rssi_val;
				bestRssiDevId = i;
	        }
        }
	}
	
	if(bestRssiDevId != TX_MAX_SINK_DEVICES_NUM)
	{
		// Try one more devices
		found_dev.tryConnectNum--;
		// This devices will be tried
		found_dev.dev_id[bestRssiDevId].toConnect=true;
		BTAPP_TaskState = BT_STATE_BT_AT_CONNECT;
		BT_Connect_Device(found_dev.dev_id[bestRssiDevId].bt_address);
		return true;
	}
	else
	{
		// A condition if all RSSI are zero, should not possible.
		BTAPP_TaskState = BT_STATE_BT_RUNNING;
		return false;
	}
}

void BTAPP_EnterBTPairingMode( void )
{
    if(BTAPP_TaskState == BT_STATE_BT_RUNNING)
    {
        if(BTAPP_Status.status != BT_SYSTEM_PAIRING)
        {
            Set_LED_Style(LED_1, LED_BLINK, 500, 500);      //1HZ before pairing starting
            BT_MMI_ActionCommand(ANY_MODE_ENTERING_PAIRING, 0);
        }
    }
}

void BTAPP_ToggleBTPairingMode( void )
{
    if(BTAPP_TaskState == BT_STATE_BT_RUNNING)
    {
        if(BTAPP_Status.status != BT_SYSTEM_PAIRING)
        {
            Set_LED_Style(LED_1, LED_BLINK, 500, 500);      //1HZ before pairing starting
            BT_MMI_ActionCommand(ANY_MODE_ENTERING_PAIRING, 0);
        }
		else
		{
			BT_MMI_ActionCommand(EXIT_PAIRING_MODE, 0);
		}
    }
}

void BTAPP_CheckEnterInquiryMode( void )
{
	if(BTAPP_TaskState <= BT_STATE_BT_RUNNING)
	{
		if(BTAPP_TaskState == BT_STATE_BT_RUNNING)
		{
			if(BTAPP_Status.status == BT_SYSTEM_STANDBY)
			{
				BTAPP_EnterInquiryMode();
			}
		}
		else
		{
			// Once BTAPP_TaskState enter "BT_STATE_BT_RUNNING",
			// if BTAPP_Status.status == BT_SYSTEM_STANDBY,
			// it will enter inquiry mode
			BT_pwrOnInquiry = 1;
		}
	}
	else
		BT_pwrOnInquiry = 0;
}
void BTAPP_EnterInquiryMode(void)
{
	Set_LED_Style(LED_1, LED_BLINK, 500, 500);		//1HZ before pairing starting
	BTAPP_ResetSinksInfo();
	BT_EnterInquiryMode();
}
void BTAPP_Toggle_A2DP(void)
{
    BT_MMI_ActionCommand (TOGGLE_AUDIO_PLAYBACK, 0);
}
BT_AT_MODE BTAPP_GetATMode(void)
{
	return BTAPP_AT_Mode;
}

AT_SOURCE_INPUT BTAPP_GetTxSource(void)
{
	return BTAPP_AT_Source;
}

AT_SOURCE_INPUT BTAPP_GetTxSamplingRate(void)
{
	return BTAPP_AT_SamplingRate;
}
void BTAPP_HandlePairingShortPress(void)
{
	if(BTAPP_GetStatus() == BT_STATUS_ON || 
	   BTAPP_GetStatus() == BT_STATUS_READY)
	{
		switch(BTAPP_Status.status)
		{
			case BT_SYSTEM_STANDBY:		
				//	initiate link back by 0x17
				//	a:	0x17 0x00 to link back last connected devices
				//	b:	0x17 0x04 XX where XX is device index		
				if(BTAPP_Status.pairedRecordNumber !=0)
				{
					BTAPP_Status.status = BT_SYSTEM_LINK_BACK;
					BT_LinkBackToLastDevice();
				}
			break;
			case BT_SYSTEM_CONNECTED:	
				//	Switch streaming devices
				BTAPP_Toggle_A2DP();
			break;
			case BT_SYSTEM_INQUIRY:					
				//	Cancel inquiry
				//	However, BTM status do not contains "Inquiry" status
				//	SW team will include it in next release
				Set_LED_Style(LED_1, LED_OFF, 0, 0);		//1HZ before pairing starting				
				BT_CancelInquiryMode();	
			break;
			case BT_SYSTEM_LINK_BACK:
				// Cancel link back
				BTAPP_TaskState = BT_STATE_BT_RUNNING;
			break;
		}
	}
		
}
/*-----------------------------------------------------------------------------*/
void BTAPP_ResetEEPROMtoDefault( void )
{
    BT_MMI_ActionCommand ( RESET_EEPROM_SETTING, 0);
}


/*-----------------------------------------------------------------------------*/
uint8_t* BT_GetLocalBDAddress( void )
{
    return &BTAPP_Status.BDAddr[0];
}

/*-----------------------------------------------------------------------------*/
uint8_t* Get_BTM_FWVersion( void )      //returned data is 2 bytes, refer to command set
{
    return &BTAPP_Status.FWVer[0];
}

/*-----------------------------------------------------------------------------*/
uint8_t* Get_BTM_UARTVersion( void )    //returned data is 2 bytes, refer to command set
{
    return &BTAPP_Status.UARTVer[0];
}

/*-----------------------------------------------------------------------------*/
void BTAPP_SoundVersion( void )
{
    uint8_t ver[9];
    //MCU version
    ver[0] = MCU_MAJOR_VERSION;
    ver[1] = MCU_MINOR_VERSION;
    ver[2] = MCU_SUB_VERSION;
    //BTM version
    ver[3] = BTAPP_Status.FWVer[0];
    ver[4] = BTAPP_Status.FWVer[1]>>4;
    ver[5] = BTAPP_Status.FWVer[1]&0x0f;
    BT_SoundVersion(ver, 6);
}

/*-----------------------------------------------------------------------------*/
#ifdef _CODE_FOR_APP
void BT_SendEQBytes(void)
{
	if(BTEQ_SendIndex == (BTEQ_MAX_INDEX+1) ||  BTEQ_timer1ms !=0)
	{
		return;
	}
	else if(BTEQ_SendIndex == BTEQ_MAX_INDEX)
	{
		BT_SendBytesAsEQCommandWithRedoChecksum(dspEQ, 90);
		BTEQ_SendIndex++;
	}
	else
	{
		BT_Vendor_EQCmd(dspEQ+5, BTEQ_SendIndex,(BTEQ_SendIndex == (BTEQ_MAX_INDEX - 1)) ? (DSP_EQ_SIZE % (VENDOR_CMD_SIZE-1))+1 : VENDOR_CMD_SIZE);
		BTEQ_SendIndex++;
		if(BTEQ_SendIndex == BTEQ_MAX_INDEX)
		{
			if(multiSpk_eq_route == MULTI_SPK_EQ_SLAVE)
				BTEQ_SendIndex = BTEQ_MAX_INDEX+1;
			else
				BTEQ_timer1ms = DSP_EQ_SEND_INTERVAL;
		}
		else
			BTEQ_timer1ms = DSP_EQ_SEND_INTERVAL;
		
