Scaniox/Glassphones/V2/code/--IS2083 Turnkey_1.3.0--/AT1.0.1/Software/Source Code/PIC32 MCU/firmware/bt_application/bt_app.c
	}
}

void BT_SetMultiSpkEQRoute(uint8_t route)
{
	multiSpk_eq_route = route;
}

bool BT_SendMultiSpkEQBytes(uint8_t* data, uint8_t size)
{
    uint8_t i;
    //uint16_t cmd_len;
	uint8_t *ptr = dspEQ;
	
    if((BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_STANDBY ||
    	BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTING ||
    	BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_NSPK_SLAVE ||
    	BTMSPK_GetMSPKStatus() == BT_CSB_STATUS_CONNECTED_AS_BROADCAST_SLAVE) ||
	   (multiSpk_eq_route == MULTI_SPK_EQ_MASTER))
        return false;

	*(ptr++) = 0xaa;
	*(ptr++) = 0x00;
	*(ptr++) = 84+2;
	*(ptr++) = 0x30;
	*(ptr++) = 0x13;

    for(i=0; i<size; i++)
    {
        *(ptr++) = *(data++);
    }
	BTEQ_SendIndex = 0;
	BTEQ_timer1ms = DSP_EQ_SEND_INTERVAL;  //send later to avoid master eq corrupt
    return true;
}
#endif

#ifdef _BLE_ADV_CTRL_BY_MCU
/*------------------------------------------------------------*/
void BLE_SaveMasterAddr(uint8_t * address)
{
	uint8_t i;
	for(i=0;i<6;i++)
        BT_MasterAddr[i] = address[i];
	//	BT_MasterAddr[i] = address[5-i];
	//BT_MasterAddr[0] = 255 - BT_MasterAddr[0];		
}

/*------------------------------------------------------------*/
void BLE_SaveFeatureList( uint8_t feature )
{
    BT_bleAdvFeature = feature;
}

/*------------------------------------------------------------*/
void BLE_SaveDeviceName(uint8_t* address)
{
    uint8_t i;
	uint8_t len = 0;
	if(*address >= BLE_DEVNAME_MAX_LEN){
        len = BLE_DEVNAME_MAX_LEN;
        *address = BLE_DEVNAME_MAX_LEN;
    }
    else{
        len = (uint8_t)*address;
    }
	
    for(i=0; i<=len; i++){
        BT_deviceName[i] = *address++;
    }
}

/*------------------------------------------------------------*/
void BLE_advUpdateGroupStatus(BLE_CSB_CONNECTION_STATE group_status)
{
    if(BT_groupstatus != group_status)
    {
		BT_groupstatus = group_status;
    }
}

/*------------------------------------------------------------*/
void BLE_advUpdateLinkStatus(BLE_CSB_STATE group_event)
{
	if(group_event >LINK_CONNECTED && group_event <LINK_MORE_SLAVES)
		return;
	
    if(BT_groupLinkEvent != group_event)
    {
		BT_groupLinkEvent = group_event;
    }
}

/*------------------------------------------------------------*/
bool BLE_advUpdateBTMState(BLE_BTM_STATE btm_state, bool state)
{
    uint8_t temp;
       if(btm_state >= BLE_BTM_CONN_HF)
        {
           if(state)
             BT_btmStateTemp = (BT_btmStateTemp & 0xF8) | (1 << btm_state);
           else
             BT_btmStateTemp = (BT_btmStateTemp & 0xF8) & ~(1 << btm_state);
           
            temp = BT_btmStateTemp >> 3;
            if(temp == 0x1) 
                BT_btmState = BLE_BTM_CONN_HF;
            else if (temp == 0x2)
                BT_btmState = BLE_BTM_CONN_A2DP;
            else if (temp == 0x4)
                BT_btmState = BLE_BTM_CONN_SPP_IAP;
            else if (temp != 0)
                BT_btmState = BLE_BTM_CONN_ALL;
            else
                BT_btmState = BT_btmStateTemp;
        }
        else
        {
            BT_btmState = BT_btmStateTemp = btm_state;
        }
        return true; 
}

/*------------------------------------------------------------*/
void BLE_UpdateAdvType(BLE_ADV_TYPE type)
{
    BLE_advType = type;
    if(type == CONNECTABLE_UNDIRECT_ADV)    //debugging code
        LED4_ON();          //debugging code
    else                    //debugging code
        LED4_OFF();          //debugging code
}

/*------------------------------------------------------------*/
void BLE_SetAdvData(void)
{
    uint8_t advertisingData[31];
	uint8_t* ptr = advertisingData;
    
	// AD type : Flag
	*ptr++ = 0x02;
	*ptr++ = 0x01;
	*ptr++ = 0x1A;

	// AD type : Service Data
	*ptr++ = 20;//15;       //20 for category 1
	*ptr++ = 0x16;
	*ptr++ = 0xDA;
	*ptr++ = 0xFE;
	*ptr++ = (1 << 4) | (BTAPP_Status.batteryLevel & 0x0f);
    *ptr++ = BT_btmState;
	*ptr++ = BT_groupstatus;
	*ptr++ = BT_groupLinkEvent;
    *ptr++ = BTAPP_Status.BDAddr[0];
    *ptr++ = BTAPP_Status.BDAddr[1];
    *ptr++ = BTAPP_Status.BDAddr[2];
    *ptr++ = BTAPP_Status.BDAddr[3];
    *ptr++ = BTAPP_Status.BDAddr[4];    //new added for category 1
    *ptr++ = BTAPP_Status.BDAddr[5];    //new added for category 1
	if(BT_groupstatus == SPEAKER_SINGLE)	
	{
        *ptr++ = 0;
        *ptr++ = 0;
        *ptr++ = 0;
        *ptr++ = 0;
        *ptr++ = 0;     //new added for category 1
        *ptr++ = 0;     //new added for category 1
	}
	else if((BT_groupstatus == SPEAKER_nSPK_MASTER) ||
			(BT_groupstatus == SPEAKER_BROADCAST_MASTER_ADDING)||
			(BT_groupstatus == SPEAKER_BROADCAST_MASTER))
	{
        *ptr++ = BTAPP_Status.BDAddr[0];
        *ptr++ = BTAPP_Status.BDAddr[1];
        *ptr++ = BTAPP_Status.BDAddr[2];
        *ptr++ = BTAPP_Status.BDAddr[3];
        *ptr++ = BTAPP_Status.BDAddr[4];    //new added for category 1
        *ptr++ = BTAPP_Status.BDAddr[5];    //new added for category 1
	}
	else if((BT_groupstatus == SPEAKER_nSPK_SLAVE) ||
			(BT_groupstatus == SPEAKER_BROADCAST_SLAVE))	
	{
        *ptr++ = BT_MasterAddr[0];
        *ptr++ = BT_MasterAddr[1];
        *ptr++ = BT_MasterAddr[2];
        *ptr++ = BT_MasterAddr[3];
        *ptr++ = BT_MasterAddr[4];  //new added for category 1
        *ptr++ = BT_MasterAddr[5];  //new added for category 1
	}
    *ptr++ = BT_bleAdvFeature;      //new added for category 1
    BLE_SetAdvertisingData(advertisingData, 24);    
}

/*------------------------------------------------------------*/
void BLE_SetScanRspData(void)
{
    uint8_t advertisingData[31];
    uint8_t i;
	uint8_t* ptr = advertisingData;
    
	*ptr++ = 1+BT_deviceName[0];
	*ptr++ = 0x09;     //Complete Local Name
	for(i=0; i< BT_deviceName[0]; i++)
		*ptr++ = BT_deviceName[1+i];
    BLE_SetScanResponseData(advertisingData, 2+BT_deviceName[0]);    
}

/*------------------------------------------------------------*/
void BLE_forceUpdate(void)
{
	if(BTAPP_AT_Mode == AT_RX)
	{
	    BLE_EnableAdvertising(false);
	    BLE_SetAdvData();
	    BLE_SetScanRspData();
	    BLE_SetAdvertisingType(BLE_advType);
	    BLE_EnableAdvertising(true);
	}
}
#endif
